In [77]:
import pandas as pd

In [78]:
samsong_df = pd.read_csv('../data/samsong.csv')
samsong_df['문화생활비']

0     4308
1     7644
2     5674
3     8621
4    23052
5    15330
6    19030
Name: 문화생활비, dtype: int64

In [79]:
hyundee_df = pd.read_csv('../data/hyundee.csv')
hyundee_df

    요일     식비   교통비  문화생활비    기타
0  MON  22420  2574   5339  5546
1  TUE  19940  2689   3524  2501
2  WED  18086  2281   5364  2234
3  THU  18863  2155   9942  3252
4  FRI  35144  2463  33511  2342
5  SAT  34952  2812  19397  4324
6  SUN  28513  2680  19925  4577

In [80]:
day = samsong_df['요일']
samsong_culture = samsong_df['문화생활비']
hyundee_culture = hyundee_df['문화생활비']

In [81]:
dict1 = {
    'day' : day,
    'samsong' : samsong_culture,
    'hyundee' : hyundee_culture 
}

pd.DataFrame(dict1)

   day  samsong  hyundee
0  MON     4308     5339
1  TUE     7644     3524
2  WED     5674     5364
3  THU     8621     9942
4  FRI    23052    33511
5  SAT    15330    19397
6  SUN    19030    19925